In [0]:
import pandas as pd
import seaborn as sns # for dataset

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [0]:
! pip install sidetable

Collecting sidetable
  Downloading https://files.pythonhosted.org/packages/45/cf/d9d6ea5785788b0e748336657f60d0e73e372b4b4f25e461f0096d11b850/sidetable-0.3.0.tar.gz
Requirement already satisfied: pandas>=1.0 in /usr/local/lib/python3.6/dist-packages (from sidetable) (1.0.4)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas>=1.0->sidetable) (2018.9)
Requirement already satisfied: python-dateutil>=2.6.1 in /usr/local/lib/python3.6/dist-packages (from pandas>=1.0->sidetable) (2.8.1)
Requirement already satisfied: numpy>=1.13.3 in /usr/local/lib/python3.6/dist-packages (from pandas>=1.0->sidetable) (1.18.5)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.6.1->pandas>=1.0->sidetable) (1.12.0)
Building wheels for collected packages: sidetable
  Building wheel for sidetable (setup.py) ... done
  Created wheel for sidetable: filename=sidetable-0.3.0-cp36-none-any.whl size=9391 sha256=8d3e779b9105c768647819edededf6e3a573c0f04c7094df2d4fede6a6b51b4f
  Stored in directory: /root/.cache/pip/wheels/cb/89/c8/8523a369438a97da6e37ade1cf5bb7ba6f7638a42ebc22594c
Successfully built sidetable
Installing collected packages: sidetable
Successfully installed sidetable-0.3.0

In [0]:
titanic = sns.load_dataset('titanic')

In [0]:
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [0]:
titanic['survived'].value_counts()

0    549
1    342
Name: survived, dtype: int64

In [0]:
import sidetable

In [0]:
titanic.stb.freq(['sex'], style = True)

In [0]:
titanic.stb.freq(['sex','pclass','embarked'], thresh = 0.8)

      sex  pclass embarked  ...   Percent  Cumulative Count  Cumulative Percent
0    male       3        S  ...  0.298088               265            0.298088
1    male       2        S  ...  0.109111               362            0.407199
2  female       3        S  ...  0.098988               450            0.506187
3    male       1        S  ...  0.088864               529            0.595051
4  female       2        S  ...  0.075366               596            0.670416
5  female       1        S  ...  0.053993               644            0.724409
6    male       3        C  ...  0.048369               687            0.772778
7  Others  Others   Others  ...  0.227222               889            1.000000

[8 rows x 7 columns]

In [0]:
titanic.stb.freq(['class'], value = 'fare')

    class        fare   Percent  Cumulative fare  Cumulative Percent
0   First  18177.4125  0.633493       18177.4125            0.633493
1   Third   6714.6951  0.234011       24892.1076            0.867504
2  Second   3801.8417  0.132496       28693.9493            1.000000

In [0]:
titanic.stb.freq(['embarked','pclass'], thresh= 0.8)

  embarked  pclass  Count   Percent  Cumulative Count  Cumulative Percent
0        S       3    353  0.397075               353            0.397075
1        S       2    164  0.184477               517            0.581552
2        S       1    127  0.142857               644            0.724409
3   Others  Others    245  0.275591               889            1.000000

In [0]:
titanic.stb.missing()

             Missing  Total   Percent
deck             688    891  0.772166
age              177    891  0.198653
embarked           2    891  0.002245
embark_town        2    891  0.002245
survived           0    891  0.000000
pclass             0    891  0.000000
sex                0    891  0.000000
sibsp              0    891  0.000000
parch              0    891  0.000000
fare               0    891  0.000000
class              0    891  0.000000
who                0    891  0.000000
adult_male         0    891  0.000000
alive              0    891  0.000000
alone              0    891  0.000000